neon-smart-studio/W-Link_NeonRTOS_Platform/src/W-Link/Driver/DMA/Device/STM32/DMA_STM32U0.c
void DMA_Clock_Disable()
{
#if defined (DMA1_BASE)
        __HAL_RCC_DMA1_CLK_DISABLE();
#endif //DMA1_BASE

#if defined (DMA2_BASE)
        __HAL_RCC_DMA2_CLK_DISABLE();
#endif //DMA2_BASE
}

hwDMA_OpResult DMA_NVIC_Init(hwDMA_Channel_Index channel_index)
{
        if(channel_index>=hwDMA_Channel_Index_MAX)
        {
                return hwDMA_InvalidParameter;
        }

        if(DMA_Channel_Init_Status[channel_index]==true)
        {
                return hwDMA_OK;
        }

        switch(channel_index)
        {
#if defined (STM32U031xx)
#if defined (DMA1_BASE)
#if defined (DMA1_Channel1)
                case hwDMA_Channel_Index_1:
                        HAL_NVIC_SetPriority(DMA1_Channel1_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA1_Channel1_IRQn);
                        break;
#endif
#if defined (DMA1_Channel2)
                case hwDMA_Channel_Index_2:
#endif
#if defined (DMA1_Channel3)
                case hwDMA_Channel_Index_3:
#endif
                        HAL_NVIC_SetPriority(DMA1_Channel2_3_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA1_Channel2_3_IRQn);
                        break;
#if defined (DMA1_Channel4)
                case hwDMA_Channel_Index_4:
#endif
#if defined (DMA1_Channel5)
                case hwDMA_Channel_Index_5:
#endif
#if defined (DMA1_Channel6)
                case hwDMA_Channel_Index_6:
#endif
#if defined (DMA1_Channel7)
                case hwDMA_Channel_Index_7:
#endif
                        HAL_NVIC_SetPriority(DMA1_Ch4_7_DMAMUX_OVR_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA1_Ch4_7_DMAMUX_OVR_IRQn);
                        break;
#endif
#elif defined (STM32U073xx) || defined (STM32U083xx)
#if defined (DMA1_BASE)
#if defined (DMA1_Channel1)
                case hwDMA_Channel_Index_1:
                        HAL_NVIC_SetPriority(DMA1_Channel1_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA1_Channel1_IRQn);
                        break;
#endif
#if defined (DMA1_Channel2)
                case hwDMA_Channel_Index_2:
#endif
#if defined (DMA1_Channel3)
                case hwDMA_Channel_Index_3:
#endif
                        HAL_NVIC_SetPriority(DMA1_Channel2_3_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA1_Channel2_3_IRQn);
                        break;
#endif
#if defined (DMA1_BASE)
#if defined (DMA1_Channel4)
                case hwDMA_Channel_Index_4:
#endif
#if defined (DMA1_Channel5)
                case hwDMA_Channel_Index_5:
#endif
#if defined (DMA1_Channel6)
                case hwDMA_Channel_Index_6:
#endif
#if defined (DMA1_Channel7)
                case hwDMA_Channel_Index_7:
#endif
#endif
#if defined (DMA2_BASE)
#if defined (DMA2_Channel1)
                case hwDMA_Channel_Index_9:
#endif
#if defined (DMA2_Channel2)
                case hwDMA_Channel_Index_10:
#endif
#if defined (DMA2_Channel3)
                case hwDMA_Channel_Index_11:
#endif
#if defined (DMA2_Channel4)
                case hwDMA_Channel_Index_12:
#endif
#if defined (DMA2_Channel5)
                case hwDMA_Channel_Index_13:
#endif
#endif
                        HAL_NVIC_SetPriority(DMA1_Ch4_7_DMA2_Ch1_5_DMAMUX_OVR_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA1_Ch4_7_DMA2_Ch1_5_DMAMUX_OVR_IRQn);
                        break;
#else
#if defined (DMA1_BASE)
#if defined (DMA1_Channel1)
                case hwDMA_Channel_Index_1:
                        HAL_NVIC_SetPriority(DMA1_Channel1_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA1_Channel1_IRQn);
                        break;
#endif
#if defined (DMA1_Channel2)
                case hwDMA_Channel_Index_2:
                        HAL_NVIC_SetPriority(DMA1_Channel2_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA1_Channel2_IRQn);
                        break;
#endif
#if defined (DMA1_Channel3)
                case hwDMA_Channel_Index_3:
                        HAL_NVIC_SetPriority(DMA1_Channel3_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA1_Channel3_IRQn);
                        break;
#endif
#if defined (DMA1_Channel4)
                case hwDMA_Channel_Index_4:
                        HAL_NVIC_SetPriority(DMA1_Channel4_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA1_Channel4_IRQn);
                        break;
#endif
#if defined (DMA1_Channel5)
                case hwDMA_Channel_Index_5:
                        HAL_NVIC_SetPriority(DMA1_Channel5_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA1_Channel5_IRQn);
                        break;
#endif
#if defined (DMA1_Channel6)
                case hwDMA_Channel_Index_6:
                        HAL_NVIC_SetPriority(DMA1_Channel6_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA1_Channel6_IRQn);
                        break;
#endif
#if defined (DMA1_Channel7)
                case hwDMA_Channel_Index_7:
                        HAL_NVIC_SetPriority(DMA1_Channel7_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA1_Channel7_IRQn);
                        break;
#endif
#endif //DMA1_BASE
#endif
        }

        DMA_NVIC_Init_Status[channel_index] = true;

        return hwDMA_OK;
}

hwDMA_OpResult DMA_NVIC_DeInit(hwDMA_Channel_Index channel_index)
{
        if(channel_index>=hwDMA_Channel_Index_MAX)
        {
                return hwDMA_InvalidParameter;
        }

        DMA_NVIC_Init_Status[channel_index] = false;

        switch(channel_index)
        {
#if defined (STM32U031xx)
#if defined (DMA1_BASE)
#if defined (DMA1_Channel1)
                case hwDMA_Channel_Index_1:
                        HAL_NVIC_DisableIRQ(DMA1_Channel1_IRQn);
                        break;
#endif
#if defined (DMA1_Channel2)
                case hwDMA_Channel_Index_2:
#endif
#if defined (DMA1_Channel3)
                case hwDMA_Channel_Index_3:
#endif
#if defined (DMA1_Channel2) && defined (DMA1_Channel3)
                        if(!DMA_NVIC_Init_Status[hwDMA_Channel_Index_2] && !DMA_NVIC_Init_Status[hwDMA_Channel_Index_3])
#endif
                        {
                                HAL_NVIC_DisableIRQ(DMA1_Channel2_3_IRQn);
                        }
                        break;
#if defined (DMA1_Channel4)
                case hwDMA_Channel_Index_4:
#endif
#if defined (DMA1_Channel5)
                case hwDMA_Channel_Index_5:
#endif
#if defined (DMA1_Channel6)
                case hwDMA_Channel_Index_6:
#endif
#if defined (DMA1_Channel7)
                case hwDMA_Channel_Index_7:
#endif
                        {
                                bool dma1_4_7_used = false;

#if defined (DMA1_Channel4)
                                if(DMA_NVIC_Init_Status[hwDMA_Channel_Index_4])
                                {
                                        dma1_4_7_used = true;
                                }
#endif
#if defined (DMA1_Channel5)
                                if(DMA_NVIC_Init_Status[hwDMA_Channel_Index_5])
                                {
                                        dma1_4_7_used = true;
                                }
#endif
#if defined (DMA1_Channel6)
                                if(DMA_NVIC_Init_Status[hwDMA_Channel_Index_6])
                                {
                                        dma1_4_7_used = true;
                                }
#endif
#if defined (DMA1_Channel7)
                                if(DMA_NVIC_Init_Status[hwDMA_Channel_Index_7])
                                {
                                        dma1_4_7_used = true;
                                }
#endif

                                if(!dma1_4_7_used)
                                {
                                        HAL_NVIC_DisableIRQ(DMA1_Ch4_7_DMAMUX_OVR_IRQn);
                                }
                        }
                        break;
#endif
#elif defined (STM32U073xx) || defined (STM32U083xx)
#if defined (DMA1_BASE)
#if defined (DMA1_Channel1)
                case hwDMA_Channel_Index_1:
                        HAL_NVIC_DisableIRQ(DMA1_Channel1_IRQn);
                        break;
#endif
#if defined (DMA1_Channel2)
                case hwDMA_Channel_Index_2:
#endif
#if defined (DMA1_Channel3)
                case hwDMA_Channel_Index_3:
#endif
#if defined (DMA1_Channel2) && defined (DMA1_Channel3)
                        if(!DMA_NVIC_Init_Status[hwDMA_Channel_Index_2] && !DMA_NVIC_Init_Status[hwDMA_Channel_Index_3])
#endif
                        {
                                HAL_NVIC_DisableIRQ(DMA1_Channel2_3_IRQn);
                        }
                        break;
#if defined (DMA1_BASE)
#if defined (DMA1_Channel4)
                case hwDMA_Channel_Index_4:
#endif
#if defined (DMA1_Channel5)
                case hwDMA_Channel_Index_5:
#endif
#if defined (DMA1_Channel6)
                case hwDMA_Channel_Index_6:
#endif
#if defined (DMA1_Channel7)
                case hwDMA_Channel_Index_7:
#endif
#endif
#if defined (DMA2_BASE)
#if defined (DMA2_Channel1)
                case hwDMA_Channel_Index_9:
#endif
#if defined (DMA2_Channel2)
                case hwDMA_Channel_Index_10:
#endif
#if defined (DMA2_Channel3)
                case hwDMA_Channel_Index_11:
#endif
#if defined (DMA2_Channel4)
                case hwDMA_Channel_Index_12:
#endif
#if defined (DMA2_Channel5)
                case hwDMA_Channel_Index_13:
#endif
#endif
                        {
                                bool dma1_4_7_dma2_1_5_used = false;

#if defined (DMA1_BASE)
#if defined (DMA1_Channel4)
                                if(DMA_NVIC_Init_Status[hwDMA_Channel_Index_4])
                                {
                                        dma1_4_7_dma2_1_5_used = true;
                                }
#endif
#if defined (DMA1_Channel5)
                                if(DMA_NVIC_Init_Status[hwDMA_Channel_Index_5])
                                {
                                        dma1_4_7_dma2_1_5_used = true;
                                }
#endif
#if defined (DMA1_Channel6)
                                if(DMA_NVIC_Init_Status[hwDMA_Channel_Index_6])
                                {
                                        dma1_4_7_dma2_1_5_used = true;
                                }
#endif
#if defined (DMA1_Channel7)
                                if(DMA_NVIC_Init_Status[hwDMA_Channel_Index_7])
                                {
                                        dma1_4_7_dma2_1_5_used = true;
                                }
#endif
#endif

#if defined (DMA2_BASE)
#if defined (DMA2_Channel1)
                                if(DMA_NVIC_Init_Status[hwDMA_Channel_Index_8])
                                {
                                        dma1_4_7_dma2_1_5_used = true;
                                }
#endif
#if defined (DMA2_Channel2)
                                if(DMA_NVIC_Init_Status[hwDMA_Channel_Index_9])
                                {
                                        dma1_4_7_dma2_1_5_used = true;
                                }
#endif
#if defined (DMA2_Channel3)
                                if(DMA_NVIC_Init_Status[hwDMA_Channel_Index_10])
                                {
                                        dma1_4_7_dma2_1_5_used = true;
                                }
#endif
#if defined (DMA2_Channel4)
                                if(DMA_NVIC_Init_Status[hwDMA_Channel_Index_11])
                                {
                                        dma1_4_7_dma2_1_5_used = true;
                                }
#endif
#if defined (DMA2_Channel5)
                                if(DMA_NVIC_Init_Status[hwDMA_Channel_Index_12])
                                {
                                        dma1_4_7_dma2_1_5_used = true;
                                }
#endif
#endif

